; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=49, out_folder=htg/blocksworld//training, instance_id=29, seed=2053

(define (problem blocksworld-29)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 - object)
 (:init 
    (arm-empty)
    (clear b18)
    (on b18 b34)
    (on b34 b36)
    (on b36 b11)
    (on b11 b20)
    (on b20 b24)
    (on b24 b12)
    (on b12 b22)
    (on b22 b38)
    (on b38 b25)
    (on b25 b14)
    (on b14 b49)
    (on b49 b41)
    (on b41 b39)
    (on b39 b2)
    (on b2 b33)
    (on b33 b7)
    (on b7 b16)
    (on b16 b30)
    (on b30 b27)
    (on-table b27)
    (clear b48)
    (on b48 b4)
    (on b4 b29)
    (on b29 b46)
    (on b46 b23)
    (on b23 b5)
    (on b5 b28)
    (on b28 b43)
    (on b43 b26)
    (on b26 b21)
    (on b21 b45)
    (on b45 b10)
    (on b10 b15)
    (on b15 b44)
    (on b44 b40)
    (on b40 b6)
    (on b6 b1)
    (on-table b1)
    (clear b42)
    (on b42 b31)
    (on b31 b47)
    (on b47 b8)
    (on b8 b35)
    (on b35 b32)
    (on b32 b13)
    (on b13 b9)
    (on b9 b3)
    (on b3 b17)
    (on b17 b37)
    (on b37 b19)
    (on-table b19))
 (:goal  (and 
    (clear b3)
    (on b3 b1)
    (on b1 b4)
    (on b4 b2)
    (on-table b2))))

; plan
1. (unstack b42 b31)
   deleted: (on b42 b31) (clear b42) (arm-empty)
   added: (holding b42) (clear b31)
   goals met: 0 of 5
2. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 0 of 5
3. (unstack b48 b4)
   deleted: (on b48 b4) (clear b48) (arm-empty)
   added: (holding b48) (clear b4)
   goals met: 0 of 5
4. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 0 of 5
5. (unstack b18 b34)
   deleted: (on b18 b34) (clear b18) (arm-empty)
   added: (holding b18) (clear b34)
   goals met: 0 of 5
6. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 5
7. (unstack b34 b36)
   deleted: (on b34 b36) (clear b34) (arm-empty)
   added: (holding b34) (clear b36)
   goals met: 0 of 5
8. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 0 of 5
9. (unstack b36 b11)
   deleted: (on b36 b11) (clear b36) (arm-empty)
   added: (holding b36) (clear b11)
   goals met: 0 of 5
10. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 0 of 5
11. (unstack b11 b20)
   deleted: (on b11 b20) (clear b11) (arm-empty)
   added: (holding b11) (clear b20)
   goals met: 0 of 5
12. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 5
13. (unstack b20 b24)
   deleted: (on b20 b24) (clear b20) (arm-empty)
   added: (holding b20) (clear b24)
   goals met: 0 of 5
14. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 0 of 5
15. (unstack b24 b12)
   deleted: (on b24 b12) (clear b24) (arm-empty)
   added: (holding b24) (clear b12)
   goals met: 0 of 5
16. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 0 of 5
17. (unstack b12 b22)
   deleted: (on b12 b22) (clear b12) (arm-empty)
   added: (holding b12) (clear b22)
   goals met: 0 of 5
18. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 5
19. (unstack b22 b38)
   deleted: (on b22 b38) (clear b22) (arm-empty)
   added: (holding b22) (clear b38)
   goals met: 0 of 5
20. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 0 of 5
21. (unstack b38 b25)
   deleted: (on b38 b25) (clear b38) (arm-empty)
   added: (holding b38) (clear b25)
   goals met: 0 of 5
22. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 0 of 5
23. (unstack b25 b14)
   deleted: (on b25 b14) (clear b25) (arm-empty)
   added: (holding b25) (clear b14)
   goals met: 0 of 5
24. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 0 of 5
25. (unstack b14 b49)
   deleted: (on b14 b49) (clear b14) (arm-empty)
   added: (holding b14) (clear b49)
   goals met: 0 of 5
26. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 0 of 5
27. (unstack b49 b41)
   deleted: (on b49 b41) (clear b49) (arm-empty)
   added: (holding b49) (clear b41)
   goals met: 0 of 5
28. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 0 of 5
29. (unstack b41 b39)
   deleted: (on b41 b39) (clear b41) (arm-empty)
   added: (holding b41) (clear b39)
   goals met: 0 of 5
30. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 0 of 5
31. (unstack b39 b2)
   deleted: (on b39 b2) (clear b39) (arm-empty)
   added: (holding b39) (clear b2)
   goals met: 0 of 5
32. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 0 of 5
33. (unstack b2 b33)
   deleted: (on b2 b33) (clear b2) (arm-empty)
   added: (holding b2) (clear b33)
   goals met: 0 of 5
34. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 5
35. (unstack b4 b29)
   deleted: (on b4 b29) (clear b4) (arm-empty)
   added: (holding b4) (clear b29)
   goals met: 1 of 5
36. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 2 of 5
37. (unstack b31 b47)
   deleted: (on b31 b47) (clear b31) (arm-empty)
   added: (holding b31) (clear b47)
   goals met: 2 of 5
38. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 2 of 5
39. (unstack b47 b8)
   deleted: (on b47 b8) (clear b47) (arm-empty)
   added: (holding b47) (clear b8)
   goals met: 2 of 5
40. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 2 of 5
41. (unstack b8 b35)
   deleted: (on b8 b35) (clear b8) (arm-empty)
   added: (holding b8) (clear b35)
   goals met: 2 of 5
42. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 2 of 5
43. (unstack b35 b32)
   deleted: (on b35 b32) (clear b35) (arm-empty)
   added: (holding b35) (clear b32)
   goals met: 2 of 5
44. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 2 of 5
45. (unstack b32 b13)
   deleted: (on b32 b13) (clear b32) (arm-empty)
   added: (holding b32) (clear b13)
   goals met: 2 of 5
46. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 2 of 5
47. (unstack b13 b9)
   deleted: (on b13 b9) (clear b13) (arm-empty)
   added: (holding b13) (clear b9)
   goals met: 2 of 5
48. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 2 of 5
49. (unstack b9 b3)
   deleted: (on b9 b3) (clear b9) (arm-empty)
   added: (holding b9) (clear b3)
   goals met: 3 of 5
50. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 3 of 5
51. (unstack b29 b46)
   deleted: (on b29 b46) (clear b29) (arm-empty)
   added: (holding b29) (clear b46)
   goals met: 3 of 5
52. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 3 of 5
53. (unstack b46 b23)
   deleted: (on b46 b23) (clear b46) (arm-empty)
   added: (holding b46) (clear b23)
   goals met: 3 of 5
54. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 3 of 5
55. (unstack b23 b5)
   deleted: (on b23 b5) (clear b23) (arm-empty)
   added: (holding b23) (clear b5)
   goals met: 3 of 5
56. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 3 of 5
57. (unstack b5 b28)
   deleted: (on b5 b28) (clear b5) (arm-empty)
   added: (holding b5) (clear b28)
   goals met: 3 of 5
58. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 3 of 5
59. (unstack b28 b43)
   deleted: (on b28 b43) (clear b28) (arm-empty)
   added: (holding b28) (clear b43)
   goals met: 3 of 5
60. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 3 of 5
61. (unstack b43 b26)
   deleted: (on b43 b26) (clear b43) (arm-empty)
   added: (holding b43) (clear b26)
   goals met: 3 of 5
62. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 3 of 5
63. (unstack b26 b21)
   deleted: (on b26 b21) (clear b26) (arm-empty)
   added: (holding b26) (clear b21)
   goals met: 3 of 5
64. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 3 of 5
65. (unstack b21 b45)
   deleted: (on b21 b45) (clear b21) (arm-empty)
   added: (holding b21) (clear b45)
   goals met: 3 of 5
66. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 3 of 5
67. (unstack b45 b10)
   deleted: (on b45 b10) (clear b45) (arm-empty)
   added: (holding b45) (clear b10)
   goals met: 3 of 5
68. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 3 of 5
69. (unstack b10 b15)
   deleted: (on b10 b15) (clear b10) (arm-empty)
   added: (holding b10) (clear b15)
   goals met: 3 of 5
70. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 3 of 5
71. (unstack b15 b44)
   deleted: (on b15 b44) (clear b15) (arm-empty)
   added: (holding b15) (clear b44)
   goals met: 3 of 5
72. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 3 of 5
73. (unstack b44 b40)
   deleted: (on b44 b40) (clear b44) (arm-empty)
   added: (holding b44) (clear b40)
   goals met: 3 of 5
74. (putdown b44)
   deleted: (holding b44)
   added: (clear b44) (arm-empty) (on-table b44)
   goals met: 3 of 5
75. (unstack b40 b6)
   deleted: (on b40 b6) (clear b40) (arm-empty)
   added: (holding b40) (clear b6)
   goals met: 3 of 5
76. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 3 of 5
77. (unstack b6 b1)
   deleted: (on b6 b1) (clear b6) (arm-empty)
   added: (holding b6) (clear b1)
   goals met: 3 of 5
78. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 3 of 5
79. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 3 of 5
80. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 4 of 5
81. (unstack b3 b17)
   deleted: (on b3 b17) (clear b3) (arm-empty)
   added: (holding b3) (clear b17)
   goals met: 3 of 5
82. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 5 of 5
